#### DataFrame 만들 딕셔너리 만들기

In [1]:
data = {
    '이름':['김길동','이길동','강길동','홍길동','박길동','나길동'],
    '주소':['광주','서울','대구','대전','광주','서울'],
    '나이':[33,23,30,20,21,25],
    '점수':[76,88,98,100,60,90],
    '언어':['Python','Java','C++','','','C']
}
data

{'이름': ['김길동', '이길동', '강길동', '홍길동', '박길동', '나길동'],
 '주소': ['광주', '서울', '대구', '대전', '광주', '서울'],
 '나이': [33, 23, 30, 20, 21, 25],
 '점수': [76, 88, 98, 100, 60, 90],
 '언어': ['Python', 'Java', 'C++', '', '', 'C']}

### pandas import

### DataFrame 생성

    이름  주소  나이   점수      언어
0  김길동  광주  33   76  Python
1  이길동  서울  23   88    Java
2  강길동  대구  30   98     C++
3  홍길동  대전  20  100
4  박길동  광주  21   60
5  나길동  서울  25   90       C

### DataFrame index 설정

     이름  주소  나이   점수      언어
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100
5번  박길동  광주  21   60
6번  나길동  서울  25   90       C

Index(['1번', '2번', '3번', '4번', '5번', '6번'], dtype='object')

#### index 이름 설정

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100
5번  박길동  광주  21   60
6번  나길동  서울  25   90       C

### index 초기화

   번호   이름  주소  나이   점수      언어
0  1번  김길동  광주  33   76  Python
1  2번  이길동  서울  23   88    Java
2  3번  강길동  대구  30   98     C++
3  4번  홍길동  대전  20  100
4  5번  박길동  광주  21   60
5  6번  나길동  서울  25   90       C

    이름  주소  나이   점수      언어
0  김길동  광주  33   76  Python
1  이길동  서울  23   88    Java
2  강길동  대구  30   98     C++
3  홍길동  대전  20  100
4  박길동  광주  21   60
5  나길동  서울  25   90       C

    이름  주소  나이   점수      언어
0  김길동  광주  33   76  Python
1  이길동  서울  23   88    Java
2  강길동  대구  30   98     C++
3  홍길동  대전  20  100
4  박길동  광주  21   60
5  나길동  서울  25   90       C

### index 설정

     주소  나이   점수      언어
이름
김길동  광주  33   76  Python
이길동  서울  23   88    Java
강길동  대구  30   98     C++
홍길동  대전  20  100
박길동  광주  21   60
나길동  서울  25   90       C

    이름  주소  나이   점수      언어
0  김길동  광주  33   76  Python
1  이길동  서울  23   88    Java
2  강길동  대구  30   98     C++
3  홍길동  대전  20  100
4  박길동  광주  21   60
5  나길동  서울  25   90       C

     주소  나이   점수      언어
이름
김길동  광주  33   76  Python
이길동  서울  23   88    Java
강길동  대구  30   98     C++
홍길동  대전  20  100
박길동  광주  21   60
나길동  서울  25   90       C

### index 정렬

     주소  나이   점수      언어
이름
강길동  대구  30   98     C++
김길동  광주  33   76  Python
나길동  서울  25   90       C
박길동  광주  21   60
이길동  서울  23   88    Java
홍길동  대전  20  100

     주소  나이   점수      언어
이름
홍길동  대전  20  100
이길동  서울  23   88    Java
박길동  광주  21   60
나길동  서울  25   90       C
김길동  광주  33   76  Python
강길동  대구  30   98     C++

     주소  나이   점수      언어
이름
김길동  광주  33   76  Python
이길동  서울  23   88    Java
강길동  대구  30   98     C++
홍길동  대전  20  100
박길동  광주  21   60
나길동  서울  25   90       C